let names = ["Андрусишин Олег","Балицький Олексій","Барановський Ігор","Бей Тетяна","Білас Всеволод","Білоус Андрій","Бордун Галина","Буба Євген","Вантух Володимир","Васьків Роман","Вервега Тарас","Візняк Юрій","Гагалюк Богдан","Ганущин Олександр","Гичка Михайло","Гірняк Володимир","Голуб Юрій","Грабінський Ігор","Грицик Ольга","Гудима Юрій","Дворянин Парасковія","Дейнека Анатолій","Демчина Роман","Дзюдзь Михайло"];
let table = document.getElementById(`table`);


let data =`<tr>

<th>№</th>
<th>Користувач</th>
<th>Відправити листа</th>
</tr>`;
for(i=0; i<24;i++){
data += `<tr>
<td>${i}</td>
<td>${names[i]}</td>
<td><input type="checkbox"></td>
</tr>`};

table.innerHTML = data;